xml2груминг/Documents/Премия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Премия</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.Начисления</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательРасчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

xml2груминг/Documents/Премия/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПослеОтветаНаВопросОбОчисткеТЧ(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Начисления.Очистить();
		ЗаполнитьАвтоматическиНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоматическиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ПродажиОбороты.Сотрудник КАК Сотрудник,
	              |	ПродажиОбороты.СуммаОборот КАК Сумма
	              |ИЗ
	              |	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ПродажиОбороты
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Сотрудник";
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Объект.ПериодНачисления));

	ВыборкаДетальные = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальные.Следующий() Цикл  
			СтрокаТЧ = Объект.Начисления.Добавить();
			СтрокаТЧ.Сотрудник = ВыборкаДетальные.Сотрудник;
			СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.Начисления.НайтиПоКоду("ПРОЦПРОД");
			СтрокаТЧ.ПоказательРасчета = ВыборкаДетальные.Сумма;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоматически(Команда)
	ТекстВопроса = "Будет очищена табличная часть документа. Вы согласны продолжить?";
    Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбОчисткеТЧ", ЭтаФорма);
    ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");


	
КонецПроцедуры
